HotelWebsite/app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.create(reservation_params)
---
INSERT INTO "reservations" ("apartment_type", "payment_type", "arrival_date", "departure_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"